[
  "Show a choropleth map of GDP by country.",
  "Visualize all high-income countries on a world map.",
  "Highlight countries in the \"South-Eastern Asia\" subregion on a map.",
  "Display the top 10 most populous countries as large bubbles on a map.",
  "Generate a population density choropleth map.",
  "Map countries with GDP over 1 trillion USD.",
  "Visualize countries with a \"Developing region\" economy.",
  "Show all countries from the \"Europe\" UN region.",
  "Create a choropleth showing population rank globally.",
  "Map countries whose abbreviation starts with “A”.",
  "Visualize countries with GDP below global median.",
  "Draw countries from the \"Americas\" continent.",
  "Visualize GDP per capita on the global map.",
  "Map only “Low income” countries.",
  "Compare income groups spatially across Africa.",
  "Show countries in Asia with both high GDP and population.",
  "Highlight the 10 least populous countries in Oceania.",
  "Visualize countries with missing GDP.",
  "Show countries in “Western Africa” with population over 20M.",
  "Create a thematic map grouped by UN region.",
  "Highlight countries with extreme population rank (1 or >200).",
  "Show countries in the Southern Hemisphere (approx lat < 0).",
  "Visualize income groups only for island nations (small area).",
  "Display countries with GDP per capita below $1,000.",
  "Map only countries in UN region \"Asia-Pacific\".",
  "Show the northernmost country per continent.",
  "Visualize population vs. GDP scatter map (bubble + color).",
  "Filter all landlocked countries (manually tag or preprocessed).",
  "Map all countries with abbreviations of exactly 2 letters.",
  "Display all countries with area > 2 million sq. km.",
  "Show correlation of GDP and income group by continent.",
  "Visualize countries with over 100M population not in Asia.",
  "Map only countries in subregions containing the word \"Africa\".",
  "Generate a heatmap of country centroids by GDP.",
  "Show countries in continents starting with \"A\".",
  "Visualize only top 3 countries in GDP per UN region.",
  "Map all countries whose formal name contains “Kingdom”.",
  "Draw borders only for countries with highest GDP per continent.",
  "Visualize distribution of income group in Western Hemisphere.",
  "Map countries with zero or NULL population.",
  "Map the 5 smallest countries in each continent by area.",
  "Show all countries with population > 10M but income group is 'Low income'.",
  "Display average GDP by UN region on a choropleth.",
  "Visualize countries in both 'Developing' economy and 'Upper middle income' group.",
  "Map countries in 'Asia' with the word 'Republic' in their name.",
  "Create a world map of average population by income group.",
  "Map all countries with missing values in GDP or population.",
  "Visualize countries whose abbreviation is a palindrome (e.g., 'AA').",
  "Compare total GDP per subregion with more than 5 countries.",
  "Map the top 3 most populous countries per income group.",
  "Visualize countries above the equator with GDP below median.",
  "Show countries whose centroid is within 1000km of the equator.",
  "Map countries with extreme area (top 5% largest).",
  "Visualize all countries with ‘Kingdom’ in their break name.",
  "Compare GDP per capita in island nations (area < 50,000).",
  "Create a bar chart of number of countries per income group in Africa.",
  "Show countries that are both in 'Africa' and have GDP below 50B.",
  "Visualize the spread of GDP by continent using boxplot inputs.",
  "Map countries whose centroid falls within -30° to +30° latitude.",
  "Display countries with population between 5M and 20M for focused planning.",
  "Highlight countries with GDP greater than the average of their continent.",
  "Show countries in ‘Americas’ whose centroid is west of the prime meridian.",
  "Visualize population variation across continents using log scale.",
  "Map only countries that are both high-population and low-GDP.",
  "Create a map of countries with centroid within 1,000 km of the Greenwich meridian.",
  "Identify outlier countries with very low GDP per capita (< $500).",
  "Visualize the centroid latitude distribution of countries by continent.",
  "Show only countries with names starting with “United”.",
  "Map GDP per capita for all countries grouped into quantiles.",
  "Compare mean population rank between continents.",
  "Map all countries that are in the top 10 GDP but not top 10 population.",
  "Visualize all countries whose name has more than three words.",
  "Generate a proximity-based map (countries within 1000km of France centroid).",
  "Highlight countries with population rank between 50 and 100.",
  "Visualize the GDP distribution for subregions in Asia.",
  "Map the countries that are both in the top 5 for GDP and for population.",
  "Identify countries where area > 1M km² but population < 5M.",
  "Visualize countries with the same name for formal_en and brk_name.",
  "Map UN regions where the average GDP per capita exceeds $10,000.",
  "Show countries where abbreviation and break name start with same letter.",
  "Map countries whose names end with “stan”.",
  "Highlight all countries in Eastern Hemisphere with low income.",
  "Create a heatmap of population across country centroids.",
  "Display countries in Oceania with abbreviation starting with 'N'.",
  "Show countries with high GDP per capita (> 50k) and low population (< 10M).",
  "Visualize countries with break name containing \"Republic\" or \"Kingdom\".",
  "Map top 5 GDP countries per subregion with population > 10M.",
  "Show countries with extreme outlier population (e.g., >1.5B or <100K).",
  "Map countries whose income group and economy do not match (e.g., “High income” but “Developing”).",
  "Display countries in 'Asia' or 'Africa' with missing income group.",
  "Create a map of GDP-to-area ratio to spot economic land efficiency.",
  "Show all countries in the southern hemisphere with area > 1M km².",
  "Identify countries where break name is longer than formal name.",
  "Map countries within ±20° of the equator (low-latitude zone).",
  "Compare total GDP and population of countries starting with each letter.",
  "Map countries with very high population density (>1000 people/km²).",
  "Identify countries with abbreviation matching last 3 letters of formal name.",
  "Create a choropleth map of number of countries per subregion.",
  "Map countries with NULL abbreviation or break name.",
  "Highlight countries with both population and GDP in the bottom 10%.",
  "Highlight all mountain ranges or ranges.",
  "Visualize all islands and island groups together.",
  "Map only the wetlands regions.",
  "Can you show only the plateaus across the world?",
  "Color each geographic type differently.",
  "Which regions are marked as tundra in the dataset?",
  "Display all coastal regions on the map.",
  "Show peninsulas and capes together on the map.",
  "What valleys are recorded in this dataset?",
  "Map only the geoarea entries — what does that type cover?",
  "Show lowlands that span multiple regions.",
  "Highlight the isthmuses in global geography.",
  "Display all features with type delta or depression.",
  "SELECT FEATURECLA, SUM(ST_Area(geom))/1e6 AS total_area_km2 FROM ne_10m_geography_regions_polys GROUP BY FEATURECLA ORDER BY total_area_km2 DESC;",
  "Show the top 10 largest deserts by area.",
  "Visualize valleys larger than 100,000 km².",
  "Compare the average area of each feature type.",
  "Visualize all wetlands and size them proportionally.",
  "Highlight islands grouped by size range (e.g., small, medium, large).",
  "Rank peninsulas from largest to smallest.",
  "Compare total area of Tundra vs. Plateau.",
  "Visualize the top 3 largest features in each feature type.",
  "What types of regions are most common in the dataset?",
  "Visualize all large landforms (e.g., deserts, plateaus, ranges) over 100,000 km².",
  "Group regions by terrain type (wet vs. dry) and show area coverage.",
  "Visualize possible climate zones using features like Tundra, Desert, and Wetlands.",
  "Map all geographic features that are smaller than 10,000 km² and labeled as 'Island', 'Delta', or 'Foothills'.",
  "Find geographic features with duplicate names but different types.",
  "Visualize major land-sea connectors: isthmuses and peninsulas.",
  "Show diversity of region types within each subregion.",
  "Map features that might indicate elevation change: Range/mtn, Plateau, Gorge, Foothills.",
  "Identify potentially artificial or placeholder entries like 'Dragons-be-here'.",
  "Highlight regions with very large label ranges (MAX_LABEL - MIN_LABEL).",
  "Find the most labeled regions within each type for prioritizing annotation.",
  "Which feature type occupies the most area in each region?",
  "Visualize the largest mountain ranges per region.",
  "Compare total area of deserts by region.",
  "Map only wetlands larger than 5,000 km² in Africa.",
  "Show all islands in Oceania larger than 10,000 km².",
  "In each region, rank the top 3 largest geographic features by area.",
  "For each region, compare total area covered by lakes vs. deserts.",
  "Show regions where coastlines cover more than 200,000 km².",
  "Find the smallest 'Plateau' feature in Asia.",
  "Compare average size of 'Island group' per region.",
  "Visualize all Delta-type features in South America over 1,000 km².",
  "For each region, find the feature type with the largest average area.",
  "Which regions have the most diverse feature types?",
  "Show lowland areas over 50,000 km² in each region.",
  "Visualize plateaus and valleys in each region as two layers.",
  "Show all deserts in Northern Africa.",
  "Highlight mountain ranges in South America.",
  "Map wetlands across Southeast Asia.",
  "Where are the plateaus in Central Asia?",
  "Visualize lakes across Eastern Europe.",
  "Show all coastal features near the Caribbean.",
  "Highlight peninsulas around the Middle East.",
  "Map islands in the Pacific Ocean region.",
  "Visualize tundra areas in Northern Europe.",
  "Show valleys in Southern Asia.",
  "Explore river deltas in Eastern Asia.",
  "Where are the gorges in Western North America?",
  "Show lowlands in Central Africa.",
  "Map basins across Western Asia.",
  "Visualize foothills of the Himalayas.",
  "Show all lakes on the map.",
  "Show me the 10 largest lakes on the map.",
  "Show lakes are between 100 and 500 square kilometers?",
  "Show the top 5 largest reservoirs?",
  "Let’s make a separate layer for giant lakes over 1000 km².",
  "Are there lakes under 1 km² tha?",
  "Show all alkaline lakes.",
  "Show all reservoir lakes.",
  "What are the top 10 largest reservoirs",
  "Show all historic lakes (case-insensitive match).",
  "Visualize historic lakes that vanished before 1800.",
  "Map lakes that disappeared in the 20th century.",
  "Display historic lakes that disappeared between 1500 and 1800.",
  "Visualize all oceans on the map.",
  "Show all seas on the map.",
  "Highlight all gulfs and bays together.",
  "Display all fjords and inlets with dashed borders.",
  "Map only straits and channels for navigation studies.",
  "Show all rivers.",
  "Visualize all lagoons globally.",
  "Display marine areas labeled as 'reef'.",
  "Map generic marine regions with low opacity.",
  "Visualize all 'sound' features around continents.",
  "Show the top 10 largest ocean features by area.",
  "Map all featurecla entries larger than 500,000 km².",
  "Visualize all named 'Red Sea' marine features.",
  "Show the top 10 largest marine features by area.",
  "Map all marine features larger than 1,000,000 km².",
  "Visualize only small bays under 10,000 km².",
  "Highlight large gulfs (area > 500,000 km²).",
  "Display oceans sorted by area from largest to smallest.",
  "Compare total area of each marine feature type.",
  "Show only reef and lagoon features below 5,000 km².",
  "Visualize mid-sized sea features (10k–500k km²).",
  "Map the smallest 20 marine regions by area.",
  "Highlight all marine regions with area less than 100 km².",
  "Visualize area distribution of all inlet regions.",
  "Show only rivers larger than 1000 km².",
  "Map features whose area is between 100 and 500 km²."
]